<center>
    <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/Logos/organization_logo/organization_logo.png" width="1000" alt="cognitiveclass.ai logo"  />
</center>

# Assignment: Exploratory Data Analysis with SQL

Estimated time needed: 60 minutes

# Introduction

Using this R notebook you will perform exploratory data analysis tasks using SQL queries with the RODBC R package. You will not be graded here, but you will be asked to present some of these results in your final assignment, where you will be graded on the accuracy of your results as well as the content of your SQL queries.

### Establish your Db2 connection

Load the 'RODBC' library, and use the 'odbcConnect( )' function as you did in the previous lab to establish the connection to your Db2 assets.\
Provided you successfully loaded your data into the tables in that lab, you are now ready to start running SQL queries using the RODBC library as you did in Course 3.

In [1]:
# DELETED CELL

## Task 1 - Record Count

#### Determine how many records are in the seoul_bike_sharing dataset.

### Solution 1

In [2]:
# provide your solution here
query <- "SELECT COUNT(*) FROM SEOUL_BIKE_SHARING"
view <- sqlQuery(conn,query)
view

  1
1 8465

## Task 2 - Operational Hours

#### Determine how many hours had non-zero rented bike count.

### Solution 2

In [3]:
# provide your solution here
query <- "SELECT COUNT(HOUR) FROM SEOUL_BIKE_SHARING WHERE RENTED_BIKE_COUNT <> 0"
view <- sqlQuery(conn,query)
view

  1
1 8465

## Task 3 - Weather Outlook

#### Query the the weather forecast for Seoul over the next 3 hours.

Recall that the records in the CITIES_WEATHER_FORECAST dataset are 3 hours apart, so we just need the first record from the query.

### Solution 3

In [4]:
# provide your solution here
query <- "SELECT * FROM CITIES_WEATHER_FORECAST ORDER BY FORECAST_DATETIME DESC LIMIT 1"
view <- sqlQuery(conn,query)
view

  CITY  WEATHER VISIBILITY TEMP TEMP_MIN TEMP_MAX PRESSURE HUMIDITY WIND_SPEED
1 Seoul Clouds  10000      25.1 25.1     25.1     1020     17       1.54
  WIND_DEG SEASON FORECAST_DATETIME
1 262      Spring 2021-04-21 09:00:00

## Task 4 - Seasons

#### Find which seasons are included in the seoul bike sharing dataset.

### Solution 4

In [5]:
# provide your solution here
query <- "SELECT DISTINCT SEASONS FROM SEOUL_BIKE_SHARING"
view <- sqlQuery(conn,query)
view

  SEASONS
1 Autumn
2 Spring
3 Summer
4 Winter

## Task 5 - Date Range

#### Find the first and last dates in the Seoul Bike Sharing dataset.

### Solution 5

In [6]:
# provide your solution here
query <- "SELECT MIN(DATE) FIRST_DATE, MAX(DATE) LAST_DATE FROM SEOUL_BIKE_SHARING"
view <- sqlQuery(conn,query)
view

  FIRST_DATE LAST_DATE
1 2017-12-01 2018-11-30

## Task 6 - Subquery - 'all-time high'

#### determine which date and hour had the most bike rentals.

### Solution 6

In [7]:
# provide your solution here
query <- "SELECT DATE, HOUR, RENTED_BIKE_COUNT FROM SEOUL_BIKE_SHARING ORDER BY RENTED_BIKE_COUNT DESC LIMIT 1"
view <- sqlQuery(conn,query)
view

  DATE       HOUR RENTED_BIKE_COUNT
1 2018-06-19 18   3556

## Task 7 - Hourly popularity and temperature by season

#### Determine the average hourly temperature and the average number of bike rentals per hour over each season. List the top ten results by average bike count.

### Solution 7

In [8]:
# provide your solution here
query <- "SELECT HOUR, AVG(TEMPERATURE) AVG_TEMP, AVG(RENTED_BIKE_COUNT) AVG_BIKES, SEASONS 
            FROM SEOUL_BIKE_SHARING
            GROUP BY HOUR, SEASONS
            ORDER BY AVG_BIKES DESC LIMIT 10"
view <- sqlQuery(conn,query)
view

   HOUR AVG_TEMP AVG_BIKES SEASONS
1  18   29.38791 2135.141  Summer
2  18   16.03185 1983.333  Autumn
3  19   28.27378 1889.250  Summer
4  20   27.06630 1801.924  Summer
5  21   26.27826 1754.065  Summer
6  18   15.97222 1689.311  Spring
7  22   25.69891 1567.870  Summer
8  17   17.27778 1562.877  Autumn
9  17   30.07691 1526.293  Summer
10 19   15.06346 1515.568  Autumn

## Task 8 - Rental Seasonality

#### Find the average hourly bike count during each season.

Also include the minimum, maximum, and standard deviation of the hourly bike count for each season.

### Solution 8

In [9]:
# provide your solution here
query <- "SELECT AVG(RENTED_BIKE_COUNT) AVG, MIN(RENTED_BIKE_COUNT) MIN, MAX(RENTED_BIKE_COUNT) MAX, STDDEV(RENTED_BIKE_COUNT) STDDEV, SEASONS 
            FROM SEOUL_BIKE_SHARING
            GROUP BY SEASONS"
view <- sqlQuery(conn,query)
view

  AVG       MIN MAX  STDDEV   SEASONS
1  924.1105 2   3298 617.3885 Autumn
2  746.2542 2   3251 618.5247 Spring
3 1034.0734 9   3556 690.0884 Summer
4  225.5412 3    937 150.3374 Winter

Let's explore a bit and see what might be the most significant contributing factors in terms of the provided data.

## Task 9 - Weather Seasonality

#### Consider the weather over each season. On average, what were the TEMPERATURE, HUMIDITY, WIND_SPEED, VISIBILITY, DEW_POINT_TEMPERATURE, SOLAR_RADIATION, RAINFALL, and SNOWFALL per season?

Include the average bike count as well , and rank the results by average bike count so you can see if it is correlated with the weather at all.

### Solution 9

In [10]:
# provide your solution here
query <- "SELECT SEASONS, AVG(RENTED_BIKE_COUNT) RENTED_BIKE_COUNT, AVG(TEMPERATURE) TEMPERATURE, AVG(HUMIDITY) HUMIDITY, AVG(WIND_SPEED) WIND_SPEED, AVG(VISIBILITY) VISIBILITY, AVG(DEW_POINT_TEMPERATURE) DEW_POINT_TEMPERATURE, AVG(SOLAR_RADIATION) SOLAR_RADIATION, AVG(RAINFALL) RAINFALL, AVG(SNOWFALL) SNOWFALL
            FROM SEOUL_BIKE_SHARING
            GROUP BY SEASONS
            ORDER BY RENTED_BIKE_COUNT DESC"
view <- sqlQuery(conn,query)
view

  SEASONS RENTED_BIKE_COUNT TEMPERATURE HUMIDITY WIND_SPEED VISIBILITY
1 Summer  1034.0734         26.587711   64.98143 1.609420   1501.745
2 Autumn   924.1105         13.821580   59.04491 1.492101   1558.174
3 Spring   746.2542         13.021685   58.75833 1.857778   1240.912
4 Winter   225.5412         -2.540463   49.74491 1.922685   1445.987
  DEW_POINT_TEMPERATURE SOLAR_RADIATION RAINFALL   SNOWFALL
1  18.750136            0.7612545       0.25348732 0.00000000
2   5.150594            0.5227827       0.11765617 0.06350026
3   4.091389            0.6803009       0.18694444 0.00000000
4 -12.416667            0.2981806       0.03282407 0.24750000

## Task 10 - Total Bike Count and City Info for Seoul

#### Use an implicit join across the WORLD_CITIES and the BIKE_SHARING_SYSTEMS tables to determine the total number of bikes avaialble in Seoul, plus the following city information about Seoul: CITY, COUNTRY, LAT, LON, POPULATION, in a single view.

Notice that in this case, the CITY column will work for the WORLD_CITIES table, but in general you would have to use the CITY_ASCII column.

### Solution 10

In [11]:
# provide your solution here
query <- "SELECT CITY_ASCII CITY, BIKE_SHARING_SYSTEMS.COUNTRY, LAT, LNG, POPULATION, BICYCLES
            FROM WORLD_CITIES, BIKE_SHARING_SYSTEMS
            WHERE WORLD_CITIES.CITY_ASCII = BIKE_SHARING_SYSTEMS.CITY
            AND CITY_ASCII = 'Seoul'"
view <- sqlQuery(conn,query)
view

  CITY  COUNTRY     LAT     LNG POPULATION BICYCLES
1 Seoul South Korea 37.5833 127 21794000   20000

## Task 11 - Find all city names and coordinates with comparable bike scale to Seoul's bike sharing system

#### Find all cities with total bike counts between 15000 and 20000. Return the city and country names, plus the coordinates (LAT, LNG), population, and number of bicycles for each city.

Later we will ask you to visualize these similar cities on leaflet, with some weather data.

### Solution 11

In [12]:
# provide your solution here
query <- "SELECT BIKE_SHARING_SYSTEMS.CITY, BIKE_SHARING_SYSTEMS.COUNTRY, LAT, LNG, POPULATION, BICYCLES
            FROM WORLD_CITIES, BIKE_SHARING_SYSTEMS
            WHERE WORLD_CITIES.CITY_ASCII = BIKE_SHARING_SYSTEMS.CITY
            AND BICYCLES BETWEEN 15000 AND 20000"
view <- sqlQuery(conn,query)
view

  CITY     COUNTRY     LAT     LNG      POPULATION BICYCLES
1 Shanghai China       31.1667 121.4667 22120000   19165
2 Seoul    South Korea 37.5833 127.0000 21794000   20000
3 Beijing  China       39.9050 116.3914 19433000   16000
4 Weifang  China       36.7167 119.1000  9373000   20000
5 Ningbo   China       29.8750 121.5492  7639000   15000
6 Xi'an    China       34.2667 108.9000  7135000   20000
7 Zhuzhou  China       27.8407 113.1469  3855609   20000

In [13]:
close(conn)

## Author(s)

<h4> Jeff Grossman </h4>

## Contributor(s)

<h4> Yan Luo, Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description                                                                |
| ---------- | ------- | ------------- | --------------------------------------------------------------------------------- |
| 2021-05-04 | 0.2     | Jeff Grossman | Finalize                               |
| 2021-04-22 | 0.2     | Jeff Grossman | Update as per peer review                               |
| 2021-04-10 | 0.2     | Jeff Grossman | Add data sources and implicit joins                                  |
| 2021-04-05 | 0.1     | Jeff Grossman | Start content creation                                                          |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>